import React, { PureComponent } from 'react';
import styles from './index.less';

class ICVmContract extends PureComponent {
  render() {
    return (
      <div className={styles.main}>
        <h1 className={styles.title}>EDA云服务器服务协议</h1>
        <p className={styles.right}><strong>版本生效日期：2021年8月20日</strong></p>
        <p>&nbsp;</p>
        <p><strong>提示条款</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p>欢迎您与中科芯云微电子科技有限公司（以下简称“中科芯云”）共同签署本《EDA云服务器服务协议》（下称“本协议”或“本服务协议”）并使用中科芯云服务！</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p>协议中条款前所列索引关键词仅为帮助您理解该条款表达的主旨之用，不影响或限制本协议条款的含义或解释。为维护您自身权益，建议您仔细阅读各条款具体表述。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>【审慎阅读】您在同意本协议之前，应当认真阅读本协议。</strong>请您务必审慎阅读、充分理解各条款的内容，特别是免除或者限制责任的条款、法律适用和争议解决条款，这些条款将以粗体下划线标识，您应重点阅读。<strong>如您对协议有任何疑问，可以向客服和相关业务部门进行咨询。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>【签约动作】当您阅读并点击同意本协议或以其他方式选择接受本协议后，即表示您已充分阅读、理解并接受本协议的全部内容，并与中科芯云达成一致。本协议自您通过网络页面点击确认或以其他方式选择接受本协议之日起成立。</strong>阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，请勿进行签约动作。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p className={styles.subTitle} style={{ textAlign: 'center' }}>通用服务条款</p>
        <p></p>
        <p><strong>1.  签约主体及协议范围</strong></p>
        <p></p>
        <p>本服务协议是<strong>您与中科芯云微电子科技有限公司</strong>就您使用<strong>中科芯云云服务器</strong>所签署的服务协议。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>2. 服务内容</strong></p>
        <p></p>
        <p>本协议中“服务”指：中科芯云www.chip-cloud.com 网站和客户端（以下单独或统称“中科芯云网站”）所展示的云服务器服务以及相关的技术及网络支持服务。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>3. 服务费用</strong></p>
        <p></p>
        <p>3.1. 服务费用将在您订购页面予以列明公示，您可自行选择具体服务类型并按列明的价格予以支付。您可选择先付费或后付费的服务。</p>
        <p></p>
        <p><strong>3.2. 先付费：</strong></p>
        <p></p>
        <p>3.2.1. 在您付费之后，中科芯云才开始为您提供服务。您未在下单后立即付费的，订单将为您保留7天，7天届满您仍未付费或者7天内中科芯云服务售罄的，订单失效，订单失效后中科芯云与您就服务所达成的合意失效。</p>
        <p></p>
        <p>3.2.2. 服务期满双方愿意继续合作的，您至少应在服务期满前7天内支付续费款项，以使服务得以继续进行。</p>
        <p></p>
        <p><strong>3.3. 后付费：</strong>您可先使用后付费。具体扣费规则请查看中科芯云网站上的页面展示且以页面公布的后付费服务当时有效的计费模式和标准。</p>
        <p></p>
        <p><strong>3.4. 中科芯云保留在您未按照约定支付全部费用之前不向您提供服务和/或技术支持，或者终止服务和/或技术支持的权利。同时，中科芯云保留对您的欠费要求您按日承担万分之五的违约金以及追究其他法律责任的权利。</strong></p>
        <p></p>
        <p>3.5. 您完全理解中科芯云价格体系中所有的赠送服务项目或优惠活动均为中科芯云在正常服务价格之外的一次性特别优惠，赠送的服务项目或优惠活动不可折价、冲抵服务价格。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>4. 您的权利和义务</strong></p>
        <p></p>
        <p>4.1. 成功订购服务后，您有权要求中科芯云按照本服务协议以及中科芯云网站相关页面所展示的服务说明、技术规范等内容向您提供服务。</p>
        <p></p>
        <p>4.2. 您订购中科芯云的服务后，您可享受免费的售后服务。除此之外中科芯云并提供其他付费的售后服务。</p>
        <p></p>
        <p><strong>4.3. 您应按照中科芯云的网站页面提示及本服务协议的约定支付相应服务费用。</strong></p>
        <p></p>
        <p><strong>4.4. 就中科芯云服务的使用应符合中科芯云的《服务使用规则》以及本服务协议。</strong></p>
        <p></p>
        <p>4.5.  您对自己存放在中科芯云云平台上的数据以及进入和管理中科芯云云平台上各类产品与服务的口令、密码的完整性和保密性负责。因您维护不当或保密不当致使上述数据、口令、密码等丢失或泄漏所引起的损失和后果均由您承担。</p>
        <p></p>
        <p>4.6. 您须依照《网络安全法》、《互联网信息服务管理办法》等法律法规的规定保留自己网站的访问日志记录，包括发布的信息内容及其发布时间、互联网地址（IP）、域名等，国家有关机关依法查询时应配合提供。您将承担未按规定保留相关记录而引起的相应法律责任。</p>
        <p></p>
        <p><strong>4.7. 为了数据的安全，您应负责您数据的备份工作。中科芯云的产品或服务可能会为您配置数据备份的功能或工具，您负责操作以完成备份。</strong></p>
        <p></p>
        <p><strong>4.8. 您应对您的用户业务数据的来源及内容负责，中科芯云提示您谨慎判断数据来源及内容的合法性。您将承担因您的用户业务数据内容违反法律法规、部门规章或国家政策而造成的相应结果及责任。</strong></p>
        <p></p>
        <p>4.9. 您理解并同意，中华人民共和国的国家秘密受法律保护，您有保守中华人民共和国的国家秘密的义务；您使用中科芯云服务应遵守相关保密法律法规的要求，并不得危害中华人民共和国国家秘密的安全。</p>
        <p></p>
        <p>4.10. 您还应仔细阅读并遵守中科芯云在网站页面上展示的相应服务说明、技术规范、使用流程、操作文档等内容（以上简称“操作指引”），依照相关操作指引进行操作。您将承担违反相关操作指引所引起的后果；同时，中科芯云郑重提示您，请把握风险谨慎操作。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>5. 中科芯云的权利、义务</strong></p>
        <p></p>
        <p>5.1. 中科芯云应按照约定提供服务。</p>
        <p></p>
        <p>5.2. 服务期限内，中科芯云将为您提供如下售后服务：</p>
        <p></p>
        <p>5.2.1中科芯云将为您提供免费的售后基础服务，即通过官网、电话及中科芯云APP提供7*24的电话咨询（95187、400电话）、智能在线和标准工单支持。支持范围包括：</p>
        <p></p>
        <p className={styles.num}>（1）关于中科芯云服务与产品功能、容量、架构的咨询；</p>
        <p></p>
        <p className={styles.num}>（2）使用、配置中科芯云产品的最佳实践；</p>
        <p></p>
        <p className={styles.num}>（3）中科芯云的产品相关的使用咨询，技术问题、故障诊断；</p>
        <p></p>
        <p className={styles.num}>（4）中科芯云API 和中科芯云SDK问题的故障诊断；</p>
        <p></p>
        <p className={styles.num}>（5）与中科芯云资源相关的操作或系统问题的技术支持；</p>
        <p></p>
        <p className={styles.num}>（6）与中科芯云的管理控制台或其他中科芯云官方工具相关的问题；</p>
        <p></p>
        <p className={styles.num}>（7）与中科芯云产品相关的部分第三方软件配置指导以及故障排查；</p>
        <p></p>
        <p className={styles.num}>（8）中科芯云的产品故障、异常上报；</p>
        <p></p>
        <p className={styles.num}>（9）与中科芯云相关的账号问题咨询支持；</p>
        <p></p>
        <p className={styles.num}>（10）  与中科芯云相关的财务合同问题的咨询支持；</p>
        <p></p>
        <p className={styles.num}>（11）  与中科芯云的管理控制台或其他中科芯云官方工具相关的问题。</p>
        <p></p>
        <p>5.2.2. 中科芯云同时提供付费版的售后增值服务（包括支持计划等），该等服务需在官网订购后生效使用。</p>
        <p></p>
        <p>5.2.3. 中科芯云将以官网页面公布的售后服务服务等级协议（SLA）标准向您提供相应的售后服务支持。</p>
        <p></p>
        <p>5.2.4. 中科芯云将尽最大努力为您提供第三方软件在中科芯云ECS服务器/操作系统环境中安装、配置和疑难排解的建议，中科芯云提供建议的范围包括：</p>
        <p></p>
        <p className={styles.num}>（1）关于中科芯云服务与产品功能、容量、架构的咨询；</p>
        <p></p>
        <p className={styles.num}>（2）使用、配置中科芯云产品的最佳实践范围。</p>
        <p></p>
        <p>中科芯云提供建议的范围不包括：</p>
        <p></p>
        <p className={styles.num}>（1）代码开发；</p>
        <p></p>
        <p className={styles.num}>（2）不在官网列举范围内第三方软件配置指导以及故障排查；</p>
        <p></p>
        <p className={styles.num}>（3）所有第三方软件的安装、补丁更新、测试、故障诊断、优化等日常运维服务；</p>
        <p></p>
        <p className={styles.num}>（4）基于中科芯云原生能力的三方自建业务支持。</p>
        <p></p>
        <p>5.3. 您还可通过中科芯云获得其他付费的售后服务，具体详见中科芯云的网站相关页面的收费售后服务内容。</p>
        <p></p>
        <p><strong>5.4. 中科芯云仅负责操作系统以下的底层部分及中科芯云提供的软件的运营维护，即服务的相关技术架构及中科芯云提供的操作系统等。操作系统之上部分（如您在系统上安装的应用程序）由您负责。此外，您自行升级操作系统可能会造成宕机等不良影响，请把握风险并谨慎操作。</strong></p>
        <p></p>
        <p><strong>5.5. 您了解中科芯云无法保证其所提供的服务毫无瑕疵（如中科芯云安全产品并不能保证您的硬件或软件的绝对安全），但中科芯云承诺不断提升服务质量及服务水平。所以您同意：即使中科芯云提供的服务存在瑕疵，但上述瑕疵是当时行业技术水平所无法避免的，其将不被视为中科芯云违约。您同意和中科芯云一同合作解决上述瑕疵问题。</strong></p>
        <p></p>
        <p><strong>5.6. 中科芯云的某些服务可能具备账户授权管理功能，即您可将您对服务的全部或部分操作权限授权给您指定的一个或多个被授权账户，此种情况下，任一被授权账户下进行的所有操作行为，均将被视为您通过本人账户所进行的行为，都将由您承担相应的责任和由此产生的服务费用。</strong></p>
        <p></p>
        <p><strong>5.7. 您理解并认可，中科芯云将为您提供基于某些服务的安全防护以及管理与监控的相关功能及服务（如“云监控”），尽管中科芯云对该等服务经过详细的测试，但并不能保证其与所有的软硬件系统完全兼容，亦不能保证其软件及服务的完全准确性。如果出现不兼容及软件错误的情况，您应立即关闭或停止使用相关功能，并及时联系中科芯云，获得技术支持。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>6. 用户业务数据</strong></p>
        <p></p>
        <p>6.1. 中科芯云理解并认可，您通过中科芯云提供的服务，加工、存储、上传、下载、分发以及通过其他方式处理的数据，均为您的用户业务数据，您完全拥有您的用户业务数据。</p>
        <p></p>
        <p>6.2. 就用户业务数据，中科芯云除执行您的服务要求外，不进行任何未获授权的使用及披露，但以下情形除外：</p>
        <p></p>
        <p>6.2.1. 在国家有关机关依法查询或调阅用户业务数据时，中科芯云具有按照相关法律法规或政策文件要求提供配合，并向第三方或者行政、司法等机构披露的义务；</p>
        <p></p>
        <p>6.2.2. 您和中科芯云另行协商一致。</p>
        <p></p>
        <p><strong>6.3. 您可自行对您的用户业务数据进行删除、更改等操作。如您释放服务或删除数据的，中科芯云将删除您的数据，按照您的指令不再保留该等数据。就数据的删除、更改等操作，您应谨慎操作。</strong></p>
        <p></p>
        <p><strong>6.4. 当服务期届满、服务提前终止（包括双方协商一致提前终止，其他原因导致的提前终止等）或您发生欠费时，除法律法规明确规定、主管部门要求或双方另有约定外，中科芯云仅在一定的缓冲期（以您所订购的服务适用的专有条款、产品文档、服务说明等所载明的时限为准）内继续存储您的用户业务数据（如有），缓冲期届满中科芯云将删除所有用户业务数据，包括所有缓存或者备份的副本，不再保留您的任何用户业务数据。</strong></p>
        <p></p>
        <p><strong>6.5. 用户业务数据一经删除，即不可恢复；您应承担数据因此被删除所引发的后果和责任，您理解并同意，中科芯云没有继续保留、导出或者返还用户业务数据的义务。</strong></p>
        <p></p>
        <p><strong>6.6. 根据您与中科芯云协商一致，中科芯云在您选定的数据中心存储用户业务数据。中科芯云恪守对用户的安全承诺，根据适用的法律保护用户存储在中科芯云数据中心的数据。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>7. 知识产权</strong></p>
        <p></p>
        <p>7.1. 在本协议项下一方向对方提供的任何资料、技术或技术支持、软件、服务等的知识产权均属于提供一方或其合法权利人所有； 除提供方或合法权利人明示同意外，另一方无权复制、传播、转让、许可或提供他人使用上述知识成果，否则应承担相应的责任。</p>
        <p></p>
        <p>7.2. 您应保证提交中科芯云的素材、对中科芯云服务的使用及使用中科芯云服务所产生的成果未侵犯任何第三方的合法权益。中科芯云应保证向您提供的服务未侵犯任何第三方的合法权益。</p>
        <p></p>
        <p>7.3. 如果第三方机构或个人对您使用中科芯云服务所涉及的相关素材的知识产权归属提出质疑或投诉，或对您使用的中科芯云服务的知识产权的归属提出质疑或投诉，您和中科芯云均有责任出具相关知识产权证明材料，并配合对方的相关投诉处理工作。对于因此引起的索赔、诉讼或可能向其提起诉讼,违约方应负责解决，承担费用和损失，以及使另一方免责。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>8. 保密条款</strong></p>
        <p></p>
        <p>8.1．本服务条款所称保密信息，是指一方（以下简称“接受方”）从对方（以下简称“披露方”）取得的、获知的、或因双方履行本协议而产生的商业秘密（包括财务秘密）、技术秘密、经营诀窍和（或）其他应予保密的信息和资料（包括产品资料，产品计划，价格，财务及营销规划，业务战略，客户信息，客户数据，研发，软件，硬件，API应用数据接口，技术说明，设计，特殊公式，特殊算法等），无论上述信息和资料以何种形式或载于何种载体，无论披露方在披露时是否以口头、图像或书面等方式表明其具有保密性。</p>
        <p></p>
        <p>8.2．双方应采取适当措施妥善保存对方提供的保密信息，措施的审慎程度不少于其保护自身的保密信息时的审慎程度。双方仅能将保密信息用于与本协议项下的有关用途或目的。</p>
        <p></p>
        <p>8.3．双方保证保密信息仅可在各自一方从事该业务的负责人和雇员范围内知悉，并严格限制接触上述保密信息的员工遵守本条之保密义务。</p>
        <p></p>
        <p>8.4．本条上述限制条款不适用于以下情况：</p>
        <p></p>
        <p>8.4.1．在签署本协议之时或之前，该保密信息已以合法方式属接受方所有；</p>
        <p></p>
        <p>8.4.2．保密信息在通知给接受方时，已经公开或能从公开领域获得；</p>
        <p></p>
        <p>8.4.3．保密信息是接受方从与其没有保密或不透露义务的第三方获得的；</p>
        <p></p>
        <p>8.4.4．在不违反本协议约定责任的前提下，该保密信息已经公开或能从公开领域获得；</p>
        <p></p>
        <p>8.4.5．该保密信息是接受方或其关联或附属公司独立开发，而且未从通知方或其关联或附属公司获得的信息中获益；</p>
        <p></p>
        <p>8.4.6．接受方应法院或其它法律、行政管理部门要求（通过口头提问、询问、要求资料或文件、传唤、民事或刑事调查或其他程序）因而透露保密信息；</p>
        <p></p>
        <p>8.4.7．接受方为向行政管理部门、行业协会等机构申请某项业务资质、获得某项认定、或符合国家、行业标准/认证，需结合对方情况向前述机构提交材料或进行说明的而披露的信息，在该等情况下，接受方应秉持必要情况下最少披露原则及要求因此获知保密信息的机构按不低于本协议的标准予以保密。</p>
        <p></p>
        <p><strong>8.5. 您和中科芯云都应尽最大的努力保护上述保密信息不被泄露。一旦发现有上述保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。如因此给对方造成损失的，应赔偿因此给对方造成的直接经济损失。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>9. 服务的开通、终止与变更</strong></p>
        <p></p>
        <p><strong>9.1. 先付费的服务：</strong></p>
        <p></p>
        <p>9.1.1. 您付费后服务即开通，开通后您获得中科芯云向您发送的登录、使用服务的密钥、口令即可使用服务，服务期限自开通之时起算（而非自您获得登录、使用服务的密钥、口令时起算）；</p>
        <p></p>
        <p>9.1.2. 以包年包月等固定期限形式售卖的服务，服务期限至订购的期限届满为止；以资源包（或套餐包）形式售卖的服务，服务期限则至您订购的资源包服务期限到期或资源包中的服务被使用完毕为止（以前述二者早发生为准）；</p>
        <p></p>
        <p><strong>9.1.3. 您应在服务期限内将资源包的服务数量使用完毕，如资源包的服务期限届满，您已订购但未使用完毕的服务将被作废且中科芯云将不提供其他替代或补充；</strong></p>
        <p></p>
        <p><strong>9.1.4. 您对于服务的使用将优先消耗订购的资源包，除法定及双方另行约定外，如资源包中的各项服务使用完毕或者服务期限到期，且您未继续订购资源包服务但持续使用此项服务的，中科芯云将视为您使用中科芯云以后付费形式售卖的该服务（如有），中科芯云将持续计费并根据计费结果予以扣划服务费用。</strong></p>
        <p></p>
        <p><strong>9.2. 后付费的服务：</strong></p>
        <p></p>
        <p>除非另有其他约定或您未结清其他应付款项的，您开通服务即可使用中科芯云的服务；您应确保您的账户余额充足，以便持续使用服务至法律规定或本服务协议约定的终止情形出现时为止。</p>
        <p></p>
        <p>9.3. 发生下列情形之一的，服务期限提前终止：</p>
        <p></p>
        <p>9.3.1. 双方协商一致提前终止的；</p>
        <p></p>
        <p>9.3.2. 您严重违反本协议（包括，您严重违反相关法律法规规定，或您严重违反本协议项下之任一承诺内容等），中科芯云有权提前终止服务直至清除您的全部数据；</p>
        <p></p>
        <p>9.3.3. 您理解并充分认可，虽然中科芯云已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括DDoS）等危害网络安全事项或行为（以下统称该等行为），<strong>但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，因此如因您网站遭遇该等行为而给中科芯云或者中科芯云的其他网络或服务器（包括本地及外地和国际的网络、服务器等）带来危害，或影响中科芯云与国际互联网或者中科芯云与特定网络、服务器及中科芯云内部的通畅联系，中科芯云可决定暂停或终止服务。如果终止服务的，将按照实际提供服务月份计算（不足一个月的按天计）服务费用，将剩余款项（如有）返还：</strong></p>
        <p></p>
        <p><strong>9.3.4. 中科芯云可提前30天在中科芯云网站上通告或给您发网站内通知或书面通知的方式终止本服务服务协议；届时中科芯云应将您已预付但未消费的款项退还至您的中科芯云账户。</strong></p>
        <p></p>
        <p><strong>9.4．您理解并认可，为技术升级、服务体系升级、或因经营策略调整或配合国家重大技术、法规政策等变化，中科芯云不保证永久的提供某种服务，并有权变更所提供服务的形式、规格或其他方面（如服务的价格和计费模式），在终止该种服务或进行此种变更前，中科芯云将尽最大努力且提前以网站公告、站内信、邮件或短信等一种或多种方式进行事先通知。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>10. 违约责任</strong></p>
        <p></p>
        <p><strong>10.1．您违反本协议中的承诺、保证条款、服务使用规则或义务的任一内容，或中科芯云根据其判断认为您的使用行为存在异常的，中科芯云均有权就其情节，根据独立判断并单方采取以下措施中的一种或多种：（1）限制、中止使用服务；（2）终止提供服务，终止本协议；（3）追究您的法律责任；（4）其他中科芯云认为适合的处理措施。中科芯云依据前述约定采取中止服务、终止服务等措施而造成的用户损失将由您承担。</strong></p>
        <p></p>
        <p><strong>10.2．如因您违反有关法律法规或者本协议、相关规则之规定，使中科芯云遭受任何损失、受到其他用户、任何第三方的索赔或任何行政管理部门的处罚，您应对中科芯云、其他用户或相关第三方的实际损失进行全额赔偿，包括合理的律师费用。</strong></p>
        <p></p>
        <p><strong>10.3．您理解且同意，鉴于计算机、互联网的特殊性，下述情况不属于中科芯云违约：</strong></p>
        <p></p>
        <p><strong>10.3.1. 中科芯云在进行系统及服务器配置、维护、升级时，需要短时间中断服务；</strong></p>
        <p></p>
        <p><strong>10.3.2. 由于Internet上的通路阻塞造成您网站访问速度下降。</strong></p>
        <p></p>
        <p>10.4．如果因中科芯云原因造成您连续72小时不能正常使用服务的，您可终止接受服务，但非中科芯云控制之内的原因引起的除外。</p>
        <p></p>
        <p>10.5．在任何情况下，中科芯云均不对任何间接性、后果性、惩戒性、偶然性、特殊性的损害，包括您使用中科芯云服务而遭受的利润损失承担责任（即使您已被告知该等损失的可能性）。</p>
        <p></p>
        <p><strong>10.6. 在法律允许的情况下，中科芯云在本协议项下所承担的损失赔偿责任不超过就该服务过往12个月所缴纳的服务费用的总和。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>11.通知</strong></p>
        <p></p>
        <p>11.1. 您在使用中科芯云服务时，您应该向中科芯云提供真实有效的联系方式（包括您的电子邮件地址、联系电话、联系地址等），对于联系方式发生变更的，您有义务及时更新有关信息，并保持可被联系的状态。您接收站内信、系统消息的会员账号（包括子账号），也作为您的有效联系方式。</p>
        <p></p>
        <p><strong>11.2. 中科芯云将向您的上述联系方式的其中之一或其中若干向您送达各类通知，而此类通知的内容可能对您的权利义务产生重大的有利或不利影响，请您务必及时关注。</strong></p>
        <p></p>
        <p>11.3. 中科芯云通过上述联系方式向您发出通知，其中以电子的方式发出的书面通知，包括公告，向您提供的联系电话发送手机短信，向您提供的电子邮件地址发送电子邮件，向您的账号发送系统消息以及站内信信息，在发送成功后即视为送达；以纸质载体发出的书面通知，按照提供联系地址交邮后的第五个自然日即视为送达。</p>
        <p></p>
        <p>11.4. 你应当保证所提供的联系方式是准确、有效的，并进行实时更新。如果因提供的联系方式不确切，或不及时告知变更后的联系方式，使法律文书无法送达或未及时送达，将由您承担由此可能产生的法律后果。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>12. 不可抗力</strong></p>
        <p></p>
        <p>12.1. 因不可抗力或者其他意外事件，使得本服务协议的履行不可能、不必要或者无意义的，遭受不可抗力、意外事件的一方不承担责任。</p>
        <p></p>
        <p>12.2. 不可抗力、意外事件是指不能预见、不能克服并不能避免且对一方或双方当事人造成重大影响的客观事件，包括自然灾害如洪水、地震、瘟疫流行等以及社会事件如战争、动乱、政府行为、电信主干线路中断、黑客、网路堵塞、电信部门技术调整和政府管制等。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>13. 法律适用及争议解决</strong></p>
        <p></p>
        <p><strong>13.1. 本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律；如法律无相关规定的，参照商业惯例及/或行业惯例。</strong></p>
        <p></p>
        <p><strong>13.2. 您因使用中科芯云服务所产生及与中科芯云服务有关的争议，由中科芯云与您协商解决。协商不成时，任何一方均可向杭州市西湖区人民法院提起诉讼。</strong></p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p><strong>14. 附则</strong></p>
        <p></p>
        <p>14.1. 本协议的附件，以及中科芯云在中科芯云网站相关页面上的服务说明、价格说明和您确认同意的订购页面（包括产品的专用条款、服务说明、操作文档等）均为本协议不可分割的一部分。如遇不一致之处，以（1）服务说明、价格说明、其他订购页面，（2）专用条款和附件，（3）本协议通用条款的顺序予以适用。</p>
        <p></p>
        <p><strong>14.2. 如本协议内容发生变动，中科芯云应通过提前30天在中科芯云网站的适当版面公告向您提示修改内容；如您继续使用中科芯云服务，则视为您接受中科芯云所做的相关修改。</strong></p>
        <p></p>
        <p><strong>14.3. 中科芯云有权经提前通知将本协议的权利义务全部或者部分转移给中科芯云的关联公司。</strong></p>
        <p></p>
        <p>14.4. 中科芯云于您过失或违约时放弃本协议规定的权利，不应视为其对您的其他或以后同类之过失或违约行为弃权。</p>
        <p></p>
        <p>14.5. 本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</p>
        <p></p>
        <p>14.6. 本协议项下之保证条款、保密条款、知识产权条款、法律适用及争议解决条款等内容，不因本协议的终止而失效。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p className={styles.subTitle} style={{ textAlign: 'center' }}>专用服务条款</p>
        <p></p>
        <p><strong>云服务器</strong></p>
        <p></p>
        <p><strong>1.【抢占式实例】</strong></p>
        <p></p>
        <p>1.1.<strong>【抢占式实例】</strong>抢占式实例是中科芯云定期或不定期为客户提供的一种价格优惠的云服务器实例，具体以中科芯云官网页面展现为准。如中科芯云未提供抢占式实例的，您仍可购买中科芯云的包年包月实例和按量付费实例。</p>
        <p></p>
        <p>1.2. <strong>【定价和出价】</strong>中科芯云根据出价高低和抢占式实例的资源池，实时确定以及调整抢占式实例的价格，并依据您的出价决定是否为您提供或继续提供抢占式实例。</p>
        <p></p>
        <p><strong>1.3. 【抢占式实例的释放】您的出价低于当前抢占式实例的价格的，且您已经持续使用抢占式实例满一个小时的，您的抢占式实例将进入待回收状态。待回收状态满5分钟的，您的抢占式实例将被中科芯云收回，实例一经收回将立即被释放并清空数据。在中科芯云收回您的抢占式实例前，您亦可随时关闭实例以终止服务。</strong></p>
        <p></p>
        <p><strong>1.4. 【待回收状态的查询】您应通过设置OPEN API来查询及关注您的抢占式实例是否进入待回收状态，或者通过实例元数据查询抢占式实例是否进入待回收状态，以便您及时迁出数据、业务备份或重新出价以获得新的抢占式实例。</strong></p>
        <p></p>
        <p><strong>1.5. 【数据迁出和备份】</strong>您理解并确认，您应自行负责抢占式实例的数据迁出以及备份。</p>
        <p></p>
        <p><strong>1.6.【竞价实例的扣费】除非依据专用条款第1.3条您的抢占式实例被收回，</strong>就抢占式实例的服务费用，中科芯云每小时自您的账户后扣划前一小时的服务费用，如服务费用不足的，您仍可继续使用竞价实例一个小时，如一个小时届满您仍未支付欠费的，中科芯云将立即终止服务，并释放实例以及清除数据。如一个小时届满前支付了欠费，您仍可继续使用该抢占式实例。</p>
        <p></p>
        <p><strong>1.7. 【服务可用性和可靠性】您理解并确认，就抢占式实例，中科芯云不对服务的可靠性以及可用性提供任何承诺。</strong></p>
        <p></p>
        <p><strong>1.8. 【服务适用】中科芯云同时郑重提示您，在使用抢占式实例前，请阅读本条款及相关业务内容并确认知悉、了解抢占式实例不进行任何服务可用性、可靠性的承诺；并审慎判断您的业务类型是否适合抢占式实例。</strong></p>
        <p></p>
        <p><strong>2. 【默认绿网功能】对于存储、发布于中科芯云云服务器（ECS）之上的公开内容，中科芯云将通过阿里绿网功能向您提示不合规或疑似不合规内容。您开通云服务器即将默认开通阿里绿网功能，如不需阿里绿网服务，您可按中科芯云官网相关服务说明予以关闭此功能，一旦在管理控制台执行关闭阿里绿网功能的操作，则您已购和将新购的任何ECS都将不再默认开通并享有阿里绿网服务。尽管有如上约定，您应负责您ECS之上的内容符合国家相关法律法规，如果被举报出现不合规内容，最严重会被追究法律责任，您应负责解决。  </strong></p>
        <p></p>
        <p><strong>3.【镜像分享功能】</strong>中科芯云的云服务器服务为您提供镜像分享的功能。您可以通过云服务器的镜像分享功能向他人提供您的镜像，也可以获取他人已提供的镜像并安装于自己的云服务器之上。在此种情况下，中科芯云仅是镜像分享的平台，并不是镜像本身的提供者，请您在提供、使用他人镜像时，谨慎判断镜像以及其中的数据是否适合公开，以及相关的安全性和适用性等情况，如因分享的镜像出现任何纠纷，将由镜像提供者和镜像使用者双方解决，中科芯云不对双方之间的达成的或涉及的法定和/或契约责任承担任何责任。</p>
        <p></p>
        <p><strong>4. 【其他使用规则】</strong></p>
        <p></p>
        <p>4.1. 如您在使用ECS服务时选择开通服务器安全服务（即云盾安骑士服务），则您认可并同意遵守《安骑士服务条款》。</p>
        <p></p>
        <p><strong>4.2. 您不应将中科芯云所提供的服务用作虚拟服务器、或用作磁盘空间出租，或用作非法代理服务器（Proxy）。</strong></p>
        <p></p>
        <p><strong>4.3. 根据中科芯云《云平台安全规则》，未经事先的报备许可，云服务器不得用于连接SMTP服务发送邮件，中科芯云默认将禁止云服务器用于SMTP服务。</strong></p>
        <p></p>
        <p><strong>4.3. 【微软服务使用要求】</strong></p>
        <p></p>
        <p><strong>中科芯云向您提供了微软的镜像操作系统（以下称微软产品），您应遵守如下：</strong></p>
        <p></p>
        <p>4.3.1 【产品所有权】微软产品由微软公司（统称“微软”）的关联公司授予许可。微软产品受版权法和其他知识产权法的保护。微软产品和其他产品元素（包括包含在产品中的任何图像、照片、动画、视频、音频、音乐、文本及“小程序”等）均归微软或其供应商所有。<strong>您不得删除、修改或掩藏产品中或产品上包含的任何版权、商标或其他专有权声明。微软产品受版权法、国际版权公约以及其他知识产权法及条约的保护。您对微软产品的占有、访问或使用并不意味着向您转让产品的任何所有权或任何知识产权；</strong></p>
        <p></p>
        <p><strong>4.3.2.您应就中科芯云向您提供的软件服务而使用、安装中科芯云向您提供的微软产品；</strong></p>
        <p></p>
        <p><strong>4.3.3.【副本】您不得制作微软产品副本；</strong></p>
        <p></p>
        <p><strong>4.3.4. 【对反向工程、反向编译和反汇编的限制】您不得对微软产品进行反向工程、反向编译或反汇编，虽然有此限制，但适用的法律明示允许此类活动的除外；</strong></p>
        <p></p>
        <p><strong>4.3.5. 【不得出租】您不得向任何第三方出租、租赁、出借、质押或直接或间接转让或分发微软产品，也不得允许任何第三方访问和/或使用产品的功能；</strong></p>
        <p></p>
        <p><strong>4.3.6. 【无微软保证、责任或赔偿】在适用法律所允许的范围内，微软和中科芯云不提供任何保证，且对于因软件服务引起的任何直接、间接或后果性损害赔偿和补偿，微软或其供应商以及中科芯云不负责任；</strong></p>
        <p></p>
        <p><strong>4.3.7. 【产品支持】对软件服务的任何支持均由中科芯云或中科芯云委托的合作伙伴向您提供，而不是由微软、微软供应商、微软关联公司或子公司提供；</strong></p>
        <p></p>
        <p><strong>4.3.8. 【非容错】微软产品不具备容错功能，并且不保证不会出现错误或操作时不会出现中断。您不得将微软产品用于由于产品故障而可能会导致死亡、严重人身伤害，或严重的物理或环境损害（以下简称“高风险使用”）的应用或情况。</strong></p>
        <p></p>
        <p><strong>5. 【到期及欠费】</strong></p>
        <p></p>
        <p>5.1. 在经典网络环境下，如包年、包月和包周等固定服务期限的云服务器到期的：</p>
        <p></p>
        <p>5.1.1. 服务期到期后，如您继续使用中科芯云ECS服务的，您应及时续费；</p>
        <p></p>
        <p><strong>5.1.2. 您服务器到期后，如未续费，中科芯云将在到期时暂停您就该ECS实例的操作权限，但仍保留该ECS实例、继续存储您的数据7日（自操作权限被暂停之日的暂停开始时刻至第7日相同时刻为期限届满）；如7日届满仍未续费，中科芯云将释放您的实例，并删除实例数据。</strong></p>
        <p></p>
        <p>5.2. 就按量付费的ECS实例，您应及时充值、缴纳服务费用以保证服务的持续使用，如您发生欠费：</p>
        <p></p>
        <p><strong>5.2.1. 自账户首次欠费之时起，中科芯云将暂停您对欠费实例的操作权限，但仍保留该ECS实例、继续存储您的数据7日（自操作权限被暂停之日的暂停开始时刻至第7日相同时刻为期限届满）；</strong></p>
        <p></p>
        <p><strong>5.2.2. 如自您首次欠费发生之时起7日届满，您仍未成功充值并足以支付所欠服务费用的，中科芯云将释放您的欠费实例，并删除实例数据。</strong></p>
        <p></p>
        <p><strong>5.3. 在VPC网络环境下，云服务器到期到期、欠费的，除按如上条款执行暂停外，中科芯云将在保留实例、存储数据15日届满之日释放欠费实例、并删除实例数据。</strong></p>
        <p></p>
        <p><strong>6. 【可信云】</strong></p>
        <p></p>
        <p>中科芯云的云服务器（不含GPU、FGPA类型的服务器）经过可信云认证，可信云更多详见《可信云》文档。</p>
        <p></p>
        <p><strong>7. 【设计目标及相关】</strong></p>
        <p></p>
        <p>   中科芯云尽做大的努力使服务符合设计目标，鉴于互联网行业的不可预见性、技术的复杂性和现有技术水平、限制，除非特别指出，设计目标并不是中科芯云的义务。但中科芯云将持续改进服务水平，尽力为您提供更优的服务体验。</p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
        <p> &nbsp; </p>
        <p></p>
      </div>
    )
  }
}

export default ICVmContract;
