import React, { PureComponent } from 'react';
import styles from './index.less';

class UserAuthContract extends PureComponent {

  render() {
    return (
      <div className={styles.main}>
        <h1 className={styles.title}>EDA云平台认证服务协议</h1>
        <p className={styles.subTitle}>【首部及导言】</p>

        <p>欢迎您阅读《EDA云平台认证服务协议》并使用EDA云平台官方认证服务！</p>

        <p>本协议是基于EDA云平台的相关协议规范（统称为“EDA云平台服务条款”）制定；同时，EDA云平台不时发布的关于本服务的相关协议、规则、声明、公告、政策、活动规则等也是本协议的一部分，<strong>您在使用本服务的同时应遵守本协议、EDA云平台服务条款及前述相关协议、规则、声明、公告、政策、活动规则、问答等所有条款。</strong></p>

        <p><strong>您申请使用本服务应当阅读并充分理解遵守本协议以及EDA云平台服务条款，本协议中与您的权益（可能）存在重大关系的条款（包括免除EDA云平台责任的条款、限制您权利的条款、约定的争议解决方式及司法管辖条款等）已采用字体加粗的方式来特别提醒您，请您留意重点查阅。若您不同意本协议中所述任何条款或其后对协议条款的修改，请立即申请停止使用本服务。您使用本服务的行为将被视为已经仔细阅读、充分理解并毫无保留地接受本协议所有条款。</strong></p>

        <p className={styles.subTitle}>一、总则</p>

        <p>EDA云平台官方认证服务（以下简称“本服务”）是EDA云平台在EDA云平台网页及客户端中设立的网络增值服务，<strong>您可向EDA云平台申请对您的EDA云平台账号（以下简称“账号”）进行认证审核，通过认证审核后您有权以官方认证信息所公示的身份对外运营，并通过官方认证标识及/或身份展示区别于其他未认证的EDA云平台用户。</strong></p>

        <p className={styles.subTitle}>二、认证审核流程</p>

        <p>1. 本服务仅向EDA云平台用户提供，如您还未注册成为EDA云平台用户，请先根据本协议及EDA云平台服务条款提示的规则、流程注册成为EDA云平台用户。</p>

        <p><strong>2. 您应当通过EDA云平台官方渠道申请本服务，并根据申请页面提示的规则、流程提供主体资格证明文件、联系方式等申请资料以完成官方认证，您承诺您提交的申请资料均真实准确、合法有效。</strong></p>

        <p><strong>EDA云平台有权对您提交的材料进行认证审核，如您提交的申请资料的真实性、准确性、合法性、有效性存在瑕疵，EDA云平台有权拒绝为您提供部分或全部本服务。如果您的申请资料不完整或发生变化，请立即重新提供或补充提供。</strong></p>

        <p><strong>3. 您理解并同意，EDA云平台向您提供不同类型的官方认证服务，根据官方认证类型的不同，</strong>EDA云平台可能向您及您的账号要求不同的认证条件、申请资料等，不同官方认证类型的具体内容请以申请页面的信息为准。</p>

        <p><strong>4. EDA云平台有权根据认证审核结果独立判断您是否满足本服务的认证条件。</strong>认证审核包括如下环节：</p>

        <p><strong>（1）用户信息审核。</strong>EDA云平台有权要求您提交主体资格证明文件（包括但不限于身份证、护照、工商营业执照、事业单位法人证书等）、权利证明书（包括但不限于授权委托书、商标注册证等）等相关申请资料，并审查核实相关申请资料是否真实准确、合法有效。如您提供的服务或内容需要取得相关法律法规规定的许可或备案，您应当主动说明并提交相关许可或备案。</p>

        <p><strong>（2）昵称/称号审核。</strong>EDA云平台有权审查核实您申请的账号昵称及认证称号是否符合官方认证要求（【帮助中心-官方认证】），并有权向您提出修改账号昵称的建议。如您在收到EDA云平台的建议后拒绝修改账号昵称，EDA云平台有权自行修改您的账号昵称或拒绝为您提供本服务。</p>

        <p><strong>（3）认证资质审核。</strong>EDA云平台有权要求您根据不同的官方认证类型提交不同的申请资料（包括但不限于运营授权、行业证照、执业/职业资质等），并审查核实您及您的账号是否符合该官方认证类型的认证条件。</p>

        <p><strong>5. 通过认证审核的所有环节视为认证审核成功，未通过认证审核的任一环节视为认证审核失败。</strong></p>

        <p><strong>6.如您成功通过认证审核，EDA云平台将根据您的申请资料为您生成官方认证信息并予以展示，官方认证信息包括官方认证标识以及根据您提交的申请资料信息生成的认证昵称、认证称号以及称号后缀，及/或执业/职业资质。EDA云平台有权根据不同类型的官方认证服务为您生成不同组合与类型的官方认证展示信息，并且EDA云平台有权根据经营策略的调整，随时更改官方认证展示信息的内容及格式。</strong></p>

        <p><strong>7. 您理解并同意，EDA云平台的认证审核仅限于依据本协议约定对申请资料进行形式审查，EDA云平台的认证审核不视为EDA云平台对通过认证审核的用户及其账号（以下简称“官方认证账号”）的真实性、合法性负责，EDA云平台不对此承担任何刑事、民事和行政责任。</strong></p>

        <p className={styles.subTitle}>三、本服务守则</p>

        <p>1. 您承诺您未与任何第三方订立与本协议相冲突的协议或类似的任何安排或承诺（包括但不限于书面记录或口头承诺等）。</p>

        <p>2. 您承诺您具有申请本服务所需的所有合法资质以及完全有效且不可撤销的授权。</p>

        <p>3. 官方认证账号应符合最新的认证条件，EDA云平台有权对官方认证账号的资质进行定期（每年）评估。</p>

        <p>4. 您在使用本服务期间应遵守法律法规、本协议、EDA云平台服务条款，不得违反社会公德、公序良俗和/或侵害他人合法权益等。</p>

        <p className={styles.subTitle}>四、保密条款</p>

        <p>1.除本协议另有约定外，接收方承诺对由披露方提供的的保密信息承担无期限的保密义务，未经披露方书面许可，不得用于本协议以外目的或以任何方式透露给第三方。接收方应当采取所有保密制度和措施保护保密信息，且保护水平应不低于接收方为保护自有保密信息所采取制度和措施。</p>

        <p>2.保密信息是指与披露方业务有关的且能为披露方带来经济利益，具有实用性的、非公知的所有信息，包括但不限于：技术信息、经营信息和与披露方行政管理有关的信息和文件（含本协议及相关协议内容）、权利归属方式、授权方式、联系方式、工作人员名单及联系方式、合作物料、素材、内容、方案等不为公众所知悉的信息。</p>

        <p className={styles.subTitle}>五、隐私政策</p>

        <p><strong>您理解并同意，EDA云平台将按照《EDA云平台隐私政策》的约定处理和保护您的个人信息。</strong></p>

        <p className={styles.subTitle}>六、 协议变更、中止及终止</p>

        <p><strong>1. EDA云平台有权根据法律法规、国家政策、行业规范以及EDA云平台经营策略的变化调整，单方变更、中止、终止本协议内容，并在相关页面进行公布。</strong></p>

        <p><strong>2. 前述内容一经在相关的页面上公布即有效代替原来的协议内容，同时EDA云平台将以适当的方式（包括但不限于弹窗、邮件、站内信、系统通知、平台通知、网站公告等）提醒您更新后的内容，以便您及时了解本协议的最新版本。</strong></p>

        <p><strong>3. 您理解并同意，如存在以下情形，EDA云平台有权中止或终止向您提供本服务及本协议，上述权利的行使无期限限制：</strong></p>

        <p><strong>（1） 您与EDA云平台经友好协商一致，均同意书面中止或终止本协议；</strong></p>

        <p><strong>（2） 您明确表示放弃或EDA云平台有合理理由认为您已放弃官方认证账号的运营；</strong></p>

        <p><strong>（3） 官方认证账号未通过EDA云平台的定期评估，或EDA云平台发现官方认证账号已不符合最新的认证条件；</strong></p>

        <p><strong>（4） EDA云平台取消或终止某项官方认证类型，或附期限的官方认证类型的有效期已届满；</strong></p>

        <p><strong>（5） 您存在或EDA云平台经独立判断后认为您存在违反法律法规、本协议及EDA云平台服务条款、社会公德、公序良俗和/或侵害他人合法权益等行为的；</strong></p>

        <p><strong>（6） 根据法律法规、监管政策的规定或有权机关的要求；</strong></p>

        <p><strong>（7） 不可抗力（鉴于互联网之特殊性质，不可抗力亦包括黑客攻击、电信部门技术调整导致之重大影响、因政府管制导致的暂时关闭、病毒侵袭等影响互联网正常运行之情形）；</strong></p>

        <p><strong>（8） 为维护账号与系统安全等紧急情况之需要的；</strong></p>

        <p><strong>（9） 其他符合本服务中止或终止条件的情形以及其他可能导致本服务中止或终止的情形。</strong></p>

        <p><strong>4. 当发生前述中止或终止的情形时，您认可如下处理方式：</strong></p>

        <p><strong>（1） EDA云平台有权单方中止或终止账号的官方认证资格并取消官方认证信息的展示；</strong></p>

        <p><strong>（2）如因您违反法律法规、本协议及EDA云平台服务条款、社会公德、公序良俗和/或侵害他人合法权益等行为导致中止或终止的，EDA云平台有权视情况要求您承担EDA云平台因此产生的全部直接或间接支出、损害或责任（包括EDA云平台向第三方支付的损害赔偿、行政处罚等）；</strong></p>

        <p><strong>（3） 除法律法规另有规定或EDA云平台另有说明外，EDA云平台无须向您和/或第三人承担任何责任。</strong></p>

        <p className={styles.subTitle}>七、其他</p>

        <p>1. 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国法律。本协议项下因与中华人民共和国现行法律冲突而导致部分无效，不影响其他部分的效力。</p>

        <p><strong>2. 如就本协议内容或执行发生任何争议，应尽量友好协商解决；协商不成时，则争议双方均一致同意将争议提交中国广州仲裁委员会按照其仲裁规则进行仲裁，仲裁裁决为一裁终局，对争议双方均有法律约束力。</strong></p>

        <p>3. 本协议未尽事宜，或与国家、地方有关规定相悖的，按有关规定执行。</p>
      </div>)
  }
}

export default UserAuthContract;
